tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "makeworld-the-better-one/tap"
tap "mongodb/brew"
# Text processing scripting language
brew "awk"
# Freely available high-quality data compressor
brew "bzip2"
# Software library to render fonts
brew "freetype"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Tool Command Language
brew "tcl-tk"
# Vector graphics library with cross-device output support
brew "cairo"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# General purpose Language Server
brew "efm-langserver"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Fulltext search engine and column store
brew "groonga"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Improved top (interactive process viewer)
brew "htop"
# GNU utilities for networking
brew "inetutils"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Library implementing a curses-based widget set for terminals
brew "libstfl"
# Rainbows and unicorns in your console!
brew "lolcat"
# Python generator for the console
brew "lorem"
# Mac App Store command-line interface
brew "mas"
# Cross platform, open source .NET development framework
brew "mono"
# Open source relational database management system
brew "mysql", restart_service: true
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@12"
# Ncurses based sudoku game
brew "nudoku"
# Manage multiple Node.js versions
brew "nvm"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rolls an amount of virtual dice
brew "rolldice"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Feature-rich console based todo list manager
brew "task"
# Client-server synchronization for todo lists
brew "taskd"
# User interface to the TELNET protocol
brew "telnet", link: false
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Android SDK component
cask "android-platform-tools"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
cask "font-fira-code"
cask "font-hack-nerd-font"
# HTTP and GraphQL Client
cask "insomnia"
cask "java"
# Open-source keystroke visualizer
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "CleanMyMac-MAS", id: 1339170533
mas "Clockify Desktop", id: 1364502317
mas "GrandPerspective", id: 1111570163
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NordVPN IKE", id: 1116599239
mas "Quiver", id: 866773894
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
mas "Yubico Authenticator", id: 1497506650
